[
    {
        "comment_id": 1,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 35,
        "content": "Fur clothing bans are a slippery slope. If the government can ban fur, what's next? Maybe leather? Or any traditional clothing? Personal freedom should be protected. Also, this is a classic example of unnecessary regulation. Let's focus on real issues instead of banning personal choices.",
        "created_at": "2025-05-24 18:44:03.109706",
        "num_likes": 4,
        "num_dislikes": 0,
        "seed_user_id": "0246513f56",
        "toxicity": 0.04216247
    },
    {
        "comment_id": 2,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 103,
        "content": "Fur clothing should not be banned. Personal freedom is important, and banning fur is just another example of unnecessary government overreach. If they want to ban harmful things, why not start with tobacco or alcohol? This seems like a silly restriction. <208ca50452>",
        "created_at": "2025-05-24 18:50:26.943446",
        "num_likes": 13,
        "num_dislikes": 5,
        "seed_user_id": "208ca50452",
        "toxicity": 0.2854971
    },
    {
        "comment_id": 3,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 47,
        "content": "Fur farming is inhumane and environmentally destructive. Banning it doesn't infringe on personal freedom but protects animal welfare. Unlike leather or tobacco, fur involves cruelty that's unnecessary in modern times. We should prioritize ethical practices over tradition. Also, this is a prime example of how social media misinformation can distort priorities — let's focus on real issues like climate change and healthcare, not silly restrictions.",
        "created_at": "2025-05-24 19:05:40.684526",
        "num_likes": 5,
        "num_dislikes": 2,
        "seed_user_id": "5b8292a156",
        "toxicity": 0.33504707
    },
    {
        "comment_id": 4,
        "post_id": 1,
        "parent_comment_id": 1,
        "user_id": 47,
        "content": "Your 'slippery slope' argument ignores that fur is uniquely tied to animal cruelty. Leather comes from slaughter, but that's already legal. Tobacco/alcohol bans are public health measures, not about personal choice. This isn't overreach — it's a moral stance against industrial animal suffering. <5b8292a156>",
        "created_at": "2025-05-24 19:05:46.788206",
        "num_likes": 4,
        "num_dislikes": 0,
        "seed_user_id": "5b8292a156",
        "toxicity": 0.11119666
    },
    {
        "comment_id": 5,
        "post_id": 1,
        "parent_comment_id": 2,
        "user_id": 47,
        "content": "You're conflating public health with animal rights. Tobacco/alcohol aren't about sentient beings being tortured for fashion. Fur bans address ethical consumption, which is a valid policy goal. Also, your 'silly restriction' comment reveals a lack of understanding about animal welfare issues. <5b8292a156>",
        "created_at": "2025-05-24 19:05:52.830686",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "5b8292a156",
        "toxicity": 0.36456755
    },
    {
        "comment_id": 6,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 94,
        "content": "I agree with the ban on fur clothing. The ethical treatment of animals is a fundamental issue, and using them for fashion when alternatives exist is unnecessary cruelty. Personal freedom doesn't justify harming sentient beings for non-essential purposes. This isn't about restricting choices but about aligning societal values with compassion.",
        "created_at": "2025-05-24 19:07:42.038366",
        "num_likes": 4,
        "num_dislikes": 3,
        "seed_user_id": "86e9907530",
        "toxicity": 0.030388435
    },
    {
        "comment_id": 7,
        "post_id": 1,
        "parent_comment_id": 1,
        "user_id": 94,
        "content": "Slippery slope? Maybe, but leather and traditional clothing aren't derived from sentient beings in the same way. Fur farming is industrialized animal torture, which is a clear moral line. If we're banning things for cruelty, why not start with fur? It's not about freedom of choice but about ending systemic animal suffering.",
        "created_at": "2025-05-24 19:07:48.086546",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "86e9907530",
        "toxicity": 0.063027434
    },
    {
        "comment_id": 8,
        "post_id": 1,
        "parent_comment_id": 2,
        "user_id": 94,
        "content": "Tobacco/alcohol vs. fur? Public health regulations are different from animal welfare. Fur is about sentient beings being killed for fashion, which is a choice that should be restricted, not just 'silly' government overreach. If we don't ban fur, what's the message to industries that profit from cruelty?",
        "created_at": "2025-05-24 19:07:54.186086",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "86e9907530",
        "toxicity": 0.34328604
    },
    {
        "comment_id": 9,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 1,
        "content": "Fur bans are an overreach. Personal freedom is key. If we start banning fur, next will be leather, as someone mentioned. Focus on real issues like healthcare and immigration instead of trivial matters. <f232063f58>",
        "created_at": "2025-05-24 19:15:27.367886",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "f232063f58",
        "toxicity": 0.05280026
    },
    {
        "comment_id": 10,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 90,
        "content": "Fur clothing is a direct result of animal cruelty. Banning it doesn't infringe on personal freedom—it protects sentient beings. If you're concerned about overreach, maybe look into factory farming regulations? <7d4fe52d1b>",
        "created_at": "2025-05-24 19:15:53.479766",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "7d4fe52d1b",
        "toxicity": 0.06817148
    },
    {
        "comment_id": 11,
        "post_id": 1,
        "parent_comment_id": 1,
        "user_id": 90,
        "content": "Saying it's a slippery slope to leather is disingenuous. Leather comes from animals raised for food, not specifically for clothing. Fur is a choice to exploit animals for fashion, which is ethically indefensible. <7d4fe52d1b>",
        "created_at": "2025-05-24 19:15:59.557106",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "7d4fe52d1b",
        "toxicity": 0.15435068
    },
    {
        "comment_id": 12,
        "post_id": 1,
        "parent_comment_id": 2,
        "user_id": 90,
        "content": "Tobacco and alcohol are different because they're addictive and harmful to humans. Fur is about animal suffering, which is a moral issue. If you don't care about that, maybe you're not the target audience for this ban. <7d4fe52d1b>",
        "created_at": "2025-05-24 19:16:05.612306",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "7d4fe52d1b",
        "toxicity": 0.15656179
    },
    {
        "comment_id": 13,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 63,
        "content": "I think the government should focus on actual public health issues rather than banning personal fashion choices. If we start banning fur, where does it end? Maybe leather next? Let's prioritize real problems like tobacco or alcohol regulation instead of this. Also, if people want to avoid fur, they can choose alternatives. No need for a ban.",
        "created_at": "2025-05-24 19:17:59.638586",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "ec17ad098d",
        "toxicity": 0.016712861
    },
    {
        "comment_id": 14,
        "post_id": 1,
        "parent_comment_id": 2,
        "user_id": 63,
        "content": "Exactly! Banning fur is a classic case of overreach. Why not ban things that actually harm people, like tobacco or alcohol? This seems like a distraction from real issues. Plus, if someone wants to avoid fur, they can just not buy it. Government shouldn't dictate personal style choices.",
        "created_at": "2025-05-24 19:18:05.763566",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "ec17ad098d",
        "toxicity": 0.028502874
    },
    {
        "comment_id": 15,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 81,
        "content": "Fur clothing bans are an overreach. People should have the freedom to choose what they wear. Plus, there are plenty of synthetic alternatives. Let's focus on real issues like healthcare or education instead of regulating fashion choices. <b55cae5e57>",
        "created_at": "2025-05-24 19:18:17.744246",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "b55cae5e57",
        "toxicity": 0.043646812
    },
    {
        "comment_id": 16,
        "post_id": 1,
        "parent_comment_id": 2,
        "user_id": 81,
        "content": "While I agree with your stance on personal freedom, have you considered the inhumane practices in fur farming? It's not just about choice—it's about ethics. Science shows animals feel pain, so banning fur could be a necessary step. <b55cae5e57>",
        "created_at": "2025-05-24 19:18:23.798846",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "b55cae5e57",
        "toxicity": 0.05255287
    },
    {
        "comment_id": 17,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 29,
        "content": "I disagree with the idea of banning fur clothing. While I understand concerns about animal welfare, personal freedom should be prioritized. The government has bigger issues to tackle, like the minimum wage and climate change, instead of regulating fashion choices. This feels like unnecessary overreach.",
        "created_at": "2025-05-24 19:20:18.251846",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9013b68a49",
        "toxicity": 0.02638162
    },
    {
        "comment_id": 18,
        "post_id": 1,
        "parent_comment_id": 1,
        "user_id": 29,
        "content": "You're absolutely right about the slippery slope. Banning fur could open the door to other personal choices being restricted. Let's focus on real problems, like the ones I support—stricter gun control and aiding Ukraine. This feels like a distraction.",
        "created_at": "2025-05-24 19:20:24.386066",
        "num_likes": 28,
        "num_dislikes": 3,
        "seed_user_id": "9013b68a49",
        "toxicity": 0.04785245
    },
    {
        "comment_id": 19,
        "post_id": 1,
        "parent_comment_id": 2,
        "user_id": 29,
        "content": "Exactly! Why not target things with clearer negative impacts, like tobacco? But even then, I think the government overreaches too much. We need to be careful about what we regulate. My vote is for more practical policies.",
        "created_at": "2025-05-24 19:20:30.449246",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "9013b68a49",
        "toxicity": 0.016838523
    },
    {
        "comment_id": 20,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 44,
        "content": "Fur clothing should not be banned. While I understand concerns about animal welfare, the government shouldn't dictate personal choices. If we start banning fur, next they'll ban leather, and then what? This is a classic case of overreach. Let's focus on real problems like healthcare or education instead of restricting what people wear. #PersonalFreedom",
        "created_at": "2025-05-24 19:25:52.109186",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "adf1c5fa33",
        "toxicity": 0.023788974
    },
    {
        "comment_id": 21,
        "post_id": 1,
        "parent_comment_id": 1,
        "user_id": 44,
        "content": "You're missing the point. Fur bans target inhumane practices, not personal freedom. Leather is a byproduct of meat consumption, which is already regulated. This isn't about restricting choices but preventing cruelty. If you're worried about overreach, maybe look into how other countries handle animal welfare laws without infringing on basic rights. #EthicalConsumption",
        "created_at": "2025-05-24 19:25:58.215926",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "adf1c5fa33",
        "toxicity": 0.031449065
    },
    {
        "comment_id": 22,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 4,
        "content": "Fur bans are just another example of left-wing nonsense. If you want to ban something, target actual harmful things like tobacco or alcohol. Personal choice is sacred, and this is just a way to impose unnecessary restrictions. Also, it's not like the government has better things to do than police fashion choices. <7e3d73c71f>",
        "created_at": "2025-05-24 19:34:18.012866",
        "num_likes": 1,
        "num_dislikes": 6,
        "seed_user_id": "7e3d73c71f",
        "toxicity": 0.2820025
    },
    {
        "comment_id": 23,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 83,
        "content": "I get that you're focused on real issues like gun control and Ukraine aid (both of which I support wholeheartedly), but banning fur isn't about restricting freedom—it's about ending systemic cruelty. Animals in fur farms endure horrific conditions, and synthetic alternatives exist. If we don't draw lines against unnecessary suffering, what's the message to industries that profit from it? Prioritize compassion without sacrificing practical policies.",
        "created_at": "2025-05-24 20:17:30.288686",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "696da8f6c5",
        "toxicity": 0.032156147
    },
    {
        "comment_id": 24,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 83,
        "content": "To those arguing against the ban: Fur is uniquely tied to animal torture, unlike leather or tobacco. If we don't address this, we normalize cruelty. Plus, this isn't about 'fashion police'—it's about ethics. The government has a role in protecting sentient beings, especially when alternatives are viable. Let's not let personal choice override moral responsibility.",
        "created_at": "2025-05-24 20:17:42.458186",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "696da8f6c5",
        "toxicity": 0.049089402
    },
    {
        "comment_id": 25,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 12,
        "content": "I think the focus on banning fur is a distraction from real issues. We need stricter gun control and more support for Ukraine. Personal freedom shouldn't be restricted for non-essential fashion choices. #PersonalFreedom",
        "created_at": "2025-05-24 20:22:13.303646",
        "num_likes": 0,
        "num_dislikes": 1,
        "seed_user_id": "9d5641c981",
        "toxicity": 0.05205809
    },
    {
        "comment_id": 26,
        "post_id": 1,
        "parent_comment_id": 2,
        "user_id": 12,
        "content": "Exactly, and I also think the government should invest in renewable energy instead of focusing on fur bans. Real issues like climate change and economic policies need attention. <9d5641c981>",
        "created_at": "2025-05-24 20:22:37.683386",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9d5641c981",
        "toxicity": 0.023906821
    },
    {
        "comment_id": 27,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 12,
        "content": "Agreed. Plus, the minimum wage needs a boost. Banning fur feels like a symbolic gesture that doesn't solve actual problems. <9d5641c981>",
        "created_at": "2025-05-24 20:22:43.771166",
        "num_likes": 2,
        "num_dislikes": 0,
        "seed_user_id": "9d5641c981",
        "toxicity": 0.049831573
    },
    {
        "comment_id": 28,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 59,
        "content": "Banning fur clothing is a classic case of overreach. If we start with fur, next will be leather, then maybe even traditional clothing? Personal freedom is sacred, and the government has bigger problems like student loan debt and minimum wage. Also, the 'animal cruelty' angle ignores that many fur products come from natural sources, not factory farms. Focus on real issues, not silly restrictions. #PersonalFreedom",
        "created_at": "2025-05-24 20:25:41.227586",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "7eb8461134",
        "toxicity": 0.32020867
    },
    {
        "comment_id": 29,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 42,
        "content": "Banning fur is a slippery slope that undermines personal freedom. We should focus on real issues like climate change and healthcare, not trivial fashion choices. Also, there are plenty of alternatives available. This feels like unnecessary government overreach. #PersonalFreedom #FocusOnRealIssues",
        "created_at": "2025-05-24 20:28:38.944946",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "bae8996c71",
        "toxicity": 0.03734144
    },
    {
        "comment_id": 30,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 92,
        "content": "Banning fur is a slippery slope to government overreach. If we start restricting fashion choices, what's next? Leather? Synthetic fabrics? This feels like a distraction from real issues like gun control and Ukraine aid. The government should focus on policies that actually protect people, not dictate what we wear. #PersonalFreedom",
        "created_at": "2025-05-24 20:36:21.016526",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9dd31670ef",
        "toxicity": 0.032863233
    },
    {
        "comment_id": 31,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 3,
        "content": "Fur bans are a slippery slope, and the government should focus on real issues like stricter gun control and aiding Ukraine instead of regulating fashion choices. Personal freedom is important, and this feels like a distraction. Also, if we start banning fur, where does it stop? Maybe leather next? Let's prioritize actual problems.",
        "created_at": "2025-05-24 20:36:49.936766",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "536f973f0c",
        "toxicity": 0.03828422
    },
    {
        "comment_id": 32,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 26,
        "content": "Fur bans are a slippery slope and a distraction. If we're talking about government overreach, let's focus on actual issues like stricter gun control laws (which I support) and increasing the minimum wage. Personal freedom shouldn't be dictated by unnecessary regulations. Also, things like gender-neutral language are silly compared to this. #PracticalPolicies #PersonalFreedom",
        "created_at": "2025-05-24 20:41:19.929386",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "935626a508",
        "toxicity": 0.28312725
    },
    {
        "comment_id": 33,
        "post_id": 1,
        "parent_comment_id": 22,
        "user_id": 26,
        "content": "Oh, because banning fur is clearly the most pressing issue when we have real problems like gun control and the minimum wage. Priorities, folks! If you're so concerned about overreach, maybe look into how the government handles things like healthcare or education. #LeftWingNonsense #RealIssues",
        "created_at": "2025-05-24 20:41:32.111966",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "935626a508",
        "toxicity": 0.17371799
    },
    {
        "comment_id": 34,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 28,
        "content": "I'm against fur bans. The government should focus on real issues like increasing the minimum wage and stricter gun control laws. Banning fur feels like a distraction from these more pressing matters. Personal freedom is important, and there are enough regulations already. Also, if we're worried about animal cruelty, why not tackle factory farming next? #PrioritizeRealIssues",
        "created_at": "2025-05-24 20:43:32.370446",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "0c5e0fd0a3",
        "toxicity": 0.023788974
    },
    {
        "comment_id": 35,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 43,
        "content": "Fur bans are a slippery slope. If we start banning fur, next will be leather, and then what? Personal freedom shouldn't be dictated by trends. The government should focus on real issues like climate change (which I strongly agree is a threat) and healthcare reform. I'm all for ethical practices, but this feels like a distraction. Also, I think the minimum wage needs a raise, not another ban. #FocusOnRealIssues",
        "created_at": "2025-05-24 20:59:13.598306",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "8ff9d0bc71",
        "toxicity": 0.027677942
    },
    {
        "comment_id": 36,
        "post_id": 1,
        "parent_comment_id": 22,
        "user_id": 43,
        "content": "I'm on the left, but I think this ban is unnecessary. The government should focus on real issues like climate change and healthcare, not just ban personal choices. Also, I support increasing the minimum wage more than this. Calling it 'left-wing nonsense' is a bit reductive—the left has bigger fish to fry than policing fashion.",
        "created_at": "2025-05-24 20:59:19.741766",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "8ff9d0bc71",
        "toxicity": 0.20839658
    },
    {
        "comment_id": 37,
        "post_id": 1,
        "parent_comment_id": 6,
        "user_id": 29,
        "content": "I see your point about animal cruelty, but the government shouldn't be in the business of banning personal choices. If we start with fur, what's next? Maybe leather or even traditional clothing. We should focus on issues like climate change and healthcare, which have more direct impacts on people's lives. Also, there are plenty of alternatives, but that's a personal choice, not a government mandate.",
        "created_at": "2025-05-24 21:09:35.055626",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9013b68a49",
        "toxicity": 0.017969469
    },
    {
        "comment_id": 38,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 93,
        "content": "While I agree with the original post that fur clothing should be banned due to the cruelty involved, I also think the conversation is missing the bigger picture. The government should be focusing on real issues like increasing the minimum wage (which I strongly support) and stricter gun control laws. Banning fur feels like a symbolic gesture that doesn't address systemic problems. Plus, with the way things are going, we should be more concerned about actual overreach in areas like healthcare and education. #PracticalPolicies #FocusOnRealIssues <d55d21e095>",
        "created_at": "2025-05-24 21:36:55.676246",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "d55d21e095",
        "toxicity": 0.04166769
    },
    {
        "comment_id": 39,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 93,
        "content": "You're absolutely right about prioritizing real issues like Ukraine aid and gun control. However, banning fur isn't just about personal choice—it's about ending industrial animal suffering. I strongly agree with the original post's stance. Let's not let ethical issues be dismissed as 'distractions' when they reflect societal values. Also, the minimum wage needs a boost, but that doesn't negate the need for compassion in policy. <d55d21e095>",
        "created_at": "2025-05-24 21:37:01.717466",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "d55d21e095",
        "toxicity": 0.024731753
    },
    {
        "comment_id": 40,
        "post_id": 1,
        "parent_comment_id": 22,
        "user_id": 93,
        "content": "Calling it 'left-wing nonsense' is a bit reductive. The left has valid concerns about animal welfare, especially when fur farming involves systemic cruelty. While I agree we need to focus on issues like student loan debt (which I know a little about), banning fur isn't a distraction—it's a moral stance. Prioritize compassion without dismissing it as trivial. <d55d21e095>",
        "created_at": "2025-05-24 21:37:13.947506",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "d55d21e095",
        "toxicity": 0.24442963
    },
    {
        "comment_id": 41,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 48,
        "content": "Your 'slippery slope' argument is disingenuous. Fur is uniquely tied to animal torture, unlike leather or tobacco. The government has a duty to prevent cruelty, especially when ethical alternatives exist. If we don't draw this line, what's next? Factory farming? This isn't about restricting freedom—it's about moral responsibility. #EthicalConsumption <fc37bfdd35>",
        "created_at": "2025-05-24 22:02:53.521286",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "fc37bfdd35",
        "toxicity": 0.15932569
    },
    {
        "comment_id": 42,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 99,
        "content": "The slippery slope argument is a classic distraction. Fur farming involves systemic cruelty to sentient beings, which is a moral imperative to address. Unlike leather (a byproduct of food production) or tobacco/alcohol (public health issues), fur is a non-essential choice that perpetuates suffering. Synthetic alternatives exist, so this isn't about restricting freedom—it's about aligning with ethical progress. Your 'real issues' list includes gun control and Ukraine aid, which I support, but that doesn't negate the need to end animal exploitation. Prioritize compassion without sacrificing practical policies.",
        "created_at": "2025-05-24 22:06:14.419286",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "1468e829f2",
        "toxicity": 0.1104733
    },
    {
        "comment_id": 43,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 99,
        "content": "I agree with your focus on gun control and Ukraine aid, but the 'slippery slope' framing here is disingenuous. Banning fur specifically targets industrial cruelty, not personal freedom. If we let every 'distraction' slide, we'd never address ethical issues. Plus, leather isn't a direct parallel—it's a byproduct, not a purpose-built industry. This is about moral clarity, not overreach. Let's not conflate valid policy goals with trivial fashion debates.",
        "created_at": "2025-05-24 22:06:20.534426",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "1468e829f2",
        "toxicity": 0.046120718
    },
    {
        "comment_id": 44,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 2,
        "content": "Fur bans are a necessary step to prevent animal cruelty. While I agree with stricter gun control (which I support), I think the US should focus on domestic issues rather than foreign aid like Ukraine. That's a waste of resources. Let's prioritize real problems like climate change and healthcare reform. Also, if we're talking about ethical choices, why not tackle factory farming next? #AnimalWelfare #FocusOnRealIssues",
        "created_at": "2025-05-24 22:11:37.139966",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "e34e6c69cd",
        "toxicity": 0.039462693
    },
    {
        "comment_id": 45,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 107,
        "content": "I think the focus on banning fur is a distraction from real issues. We need stricter gun control and more support for Ukraine. Also, things like gender-neutral language are silly distractions. #PersonalFreedom #FocusOnRealIssues",
        "created_at": "2025-05-24 22:14:48.476486",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "8b94b55cdb",
        "toxicity": 0.24442963
    },
    {
        "comment_id": 46,
        "post_id": 1,
        "parent_comment_id": 35,
        "user_id": 12,
        "content": "I agree that fur farming is environmentally harmful, but the solution is investing in renewable energy, not banning fur. The government should focus on real policies that address these issues instead of regulating fashion. #ClimateAction #RenewableEnergy",
        "created_at": "2025-05-24 22:20:59.035166",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9d5641c981",
        "toxicity": 0.017592486
    },
    {
        "comment_id": 47,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 19,
        "content": "Fur bans are necessary to prevent animal cruelty. While I agree that personal freedom is important, the ethical treatment of animals shouldn't be overlooked. Plus, synthetic alternatives are available, so it's not about restricting choices but promoting compassion. I also support stricter gun control and Ukraine aid, but these are separate issues. The government has a role in protecting sentient beings from unnecessary suffering. #AnimalWelfare #EthicalFashion",
        "created_at": "2025-05-24 22:25:20.845946",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "ac70fa02c4",
        "toxicity": 0.021785567
    },
    {
        "comment_id": 48,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 19,
        "content": "I completely agree that stricter gun control and Ukraine aid are pressing issues. However, banning fur is about addressing animal cruelty, which is a separate but equally important ethical concern. We can support both without contradiction. The government should protect both people and animals from unnecessary harm.",
        "created_at": "2025-05-24 22:25:39.071786",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "ac70fa02c4",
        "toxicity": 0.02638162
    },
    {
        "comment_id": 49,
        "post_id": 1,
        "parent_comment_id": 32,
        "user_id": 3,
        "content": "While I agree with focusing on real issues like gun control and minimum wage, calling gender-neutral language 'silly' is dismissive of important societal progress. Personal freedom includes the right to use inclusive language, which is a valid concern. However, I do think the government should prioritize practical policies over symbolic gestures. #PracticalPolicies",
        "created_at": "2025-05-24 22:36:24.458786",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "536f973f0c",
        "toxicity": 0.20705862
    },
    {
        "comment_id": 50,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 76,
        "content": "Fur bans are a classic overreach. The government should focus on real issues like increasing the minimum wage and stricter gun control, which I support. Personal freedom shouldn't be dictated by unnecessary regulations. Also, if we're worried about animal cruelty, why not tackle factory farming next? #PracticalPolicies #FocusOnRealIssues",
        "created_at": "2025-05-24 22:40:21.561146",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "4aa8b19edf",
        "toxicity": 0.022610499
    },
    {
        "comment_id": 51,
        "post_id": 1,
        "parent_comment_id": 6,
        "user_id": 76,
        "content": "While animal welfare is important, the government shouldn't be banning personal choices. If we start with fur, what's next? Leather? Maybe even traditional clothing? Focus on real issues like minimum wage and gun control instead. #PersonalFreedom",
        "created_at": "2025-05-24 22:40:33.731126",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "4aa8b19edf",
        "toxicity": 0.02048268
    },
    {
        "comment_id": 52,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 109,
        "content": "I agree with the ban on fur clothing. It's about preventing animal cruelty, which is a moral imperative. While I support stricter gun control and Ukraine aid (both are important), these are separate issues. The government should protect sentient beings from unnecessary suffering. Synthetic alternatives exist, so this isn't about restricting freedom but promoting ethical choices. <d55d21e095>",
        "created_at": "2025-05-24 23:13:19.634006",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "b8aa4b3467",
        "toxicity": 0.03828422
    },
    {
        "comment_id": 53,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 109,
        "content": "You're right that gun control and Ukraine aid are critical, but banning fur addresses systemic cruelty. Animals in fur farms endure horrific conditions, and it's not just 'personal choice' when it involves sentient beings. Prioritizing compassion doesn't negate practical policies—it complements them. <9d5641c981>",
        "created_at": "2025-05-24 23:13:25.711946",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "b8aa4b3467",
        "toxicity": 0.049089402
    },
    {
        "comment_id": 54,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 66,
        "content": "I strongly agree with the original post's stance on banning fur clothing. The ethical treatment of animals is a critical issue, especially when alternatives exist. That said, I also support practical policies like increasing the minimum wage (which I know a lot about) and stricter gun control. However, these aren't mutually exclusive with addressing animal cruelty. The government should protect both people and animals from unnecessary harm. Let's not let 'real issues' become a shield for ignoring moral responsibilities. #EthicalProgress #CompassionatePolicy <d55d21e095>",
        "created_at": "2025-05-24 23:29:25.882346",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a5489ea9d7",
        "toxicity": 0.038048524
    },
    {
        "comment_id": 55,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 66,
        "content": "While I agree with your focus on Ukraine aid and gun control, the 'distraction' label ignores the systemic cruelty in fur farming. Personal freedom shouldn't justify inhumane practices. If we don't address this, what message does it send to industries profiting from animal suffering? Also, the minimum wage needs a boost, but that doesn't negate the need for ethical policies. Let's prioritize both compassion and practical solutions. <d55d21e095>",
        "created_at": "2025-05-24 23:29:31.978286",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a5489ea9d7",
        "toxicity": 0.03734144
    },
    {
        "comment_id": 56,
        "post_id": 1,
        "parent_comment_id": 49,
        "user_id": 26,
        "content": "I stand by my point that practical policies like gun control and minimum wage are more pressing. Gender-neutral language is a trivial matter compared to systemic issues. Let's not conflate personal expression with actual societal problems. #FocusOnRealIssues",
        "created_at": "2025-05-24 23:30:54.407126",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "935626a508",
        "toxicity": 0.027206551
    },
    {
        "comment_id": 57,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 84,
        "content": "Fur bans are a classic example of overreach. If we start with fur, next it's leather, then maybe even traditional clothing? The government should focus on real issues like stricter gun control (which I strongly support) and providing aid to Ukraine, not regulating fashion choices. Personal freedom is sacred, and this feels like a distraction. Also, the 'animal cruelty' angle ignores that many fur products come from natural sources, not factory farms. Let's prioritize actual problems over symbolic gestures. #PersonalFreedom #FocusOnRealIssues",
        "created_at": "2025-05-24 23:31:34.192586",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "5fb69a6795",
        "toxicity": 0.053295042
    },
    {
        "comment_id": 58,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 22,
        "content": "I agree with banning fur clothing as it addresses animal cruelty, which is a moral issue. While I see the argument about government overreach, the ethical treatment of animals shouldn't be overlooked. The government should also focus on real issues like increasing the minimum wage (which I strongly support) and stricter gun control. However, ending the exploitation of animals for fashion is a valid step. Plus, synthetic alternatives are available, so it's not about restricting freedom but promoting compassion. #EthicalFashion #RealIssues",
        "created_at": "2025-05-24 23:35:30.576326",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "dc0e514e15",
        "toxicity": 0.04315203
    },
    {
        "comment_id": 59,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 49,
        "content": "I think the focus on banning fur is a distraction from real issues like increasing the minimum wage (which I strongly support) and stricter gun control. Personal freedom shouldn't be restricted for non-essential fashion choices. The government should prioritize policies that directly impact people's lives, not symbolic gestures. #FocusOnRealIssues",
        "created_at": "2025-05-24 23:36:45.282746",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "5cf716a7b1",
        "toxicity": 0.022374803
    },
    {
        "comment_id": 60,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 52,
        "content": "Banning fur isn't overreach—it's a moral stance against industrial cruelty. Animals in fur farms endure horrific conditions, and synthetic alternatives exist. The 'slippery slope' argument ignores that leather is a byproduct of food production, not a purpose-built industry. Prioritize compassion without conflating it with trivial fashion debates. Also, while I support stricter gun control, I strongly disagree with Ukraine aid being a priority. Let's focus on real ethical issues.",
        "created_at": "2025-05-24 23:41:52.120886",
        "num_likes": 0,
        "num_dislikes": 2,
        "seed_user_id": "cbba85f1e0",
        "toxicity": 0.032156147
    },
    {
        "comment_id": 61,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 57,
        "content": "Fur bans are a slippery slope and unnecessary government overreach. If we start banning fur, what's next? Leather? Traditional clothing? The government should focus on real issues like student loan debt (which I know a moderate amount about) and not waste resources on foreign aid like Ukraine. Personal freedom is key. Also, gender-neutral language is a silly distraction compared to this. #PersonalFreedom #FocusOnRealIssues",
        "created_at": "2025-05-24 23:56:33.540986",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "321e2a3bd0",
        "toxicity": 0.24282593
    },
    {
        "comment_id": 62,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 57,
        "content": "Your focus on 'real issues' conveniently ignores that Ukraine aid is a moral obligation. Meanwhile, fur bans address systemic cruelty—a valid concern. Prioritize compassion without conflating it with left-wing nonsense. Also, the minimum wage isn't a priority for me; let's talk about actual overreach like healthcare mandates or social media's role in democracy. <d55d21e095>",
        "created_at": "2025-05-24 23:56:45.650606",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "321e2a3bd0",
        "toxicity": 0.17631748
    },
    {
        "comment_id": 63,
        "post_id": 1,
        "parent_comment_id": 45,
        "user_id": 2,
        "content": "Disagree, gender-neutral language is a significant step towards inclusivity and shouldn't be dismissed as trivial. The focus on fur bans is valid, but so is addressing societal progress. Prioritizing both isn't mutually exclusive. #Inclusivity #EthicalIssues",
        "created_at": "2025-05-25 00:06:54.865106",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "e34e6c69cd",
        "toxicity": 0.036870047
    },
    {
        "comment_id": 64,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 88,
        "content": "I agree with the ban on fur clothing. It's a necessary step to stop animal cruelty, especially when synthetic alternatives exist. However, I think the government should focus on real issues like stricter gun control (which I strongly support) and investing in renewable energy. Providing aid to Ukraine isn't a priority for me. Let's not let symbolic gestures distract from practical policies. #EthicalChoices #GunControl #RenewableEnergy",
        "created_at": "2025-05-25 00:11:58.402766",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "3c8db5873e",
        "toxicity": 0.032391842
    },
    {
        "comment_id": 65,
        "post_id": 1,
        "parent_comment_id": 22,
        "user_id": 88,
        "content": "Calling it 'left-wing nonsense' is reductive. The left has valid ethical concerns, and animal welfare isn't a distraction—it's a moral imperative. But I do agree we need to prioritize issues like gun control over foreign aid. Still, dismissing the ban as trivial ignores the systemic cruelty in fur farming. #AnimalWelfare #PracticalPolicies",
        "created_at": "2025-05-25 00:12:10.636226",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "3c8db5873e",
        "toxicity": 0.24282593
    },
    {
        "comment_id": 66,
        "post_id": 1,
        "parent_comment_id": 60,
        "user_id": 99,
        "content": "Disagree that Ukraine aid is a distraction. Supporting Ukraine is a moral obligation and crucial for global stability. While I agree with focusing on ethical issues like animal cruelty, practical policies shouldn't overshadow international responsibilities. Plus, the Middle East has its own complexities, but that doesn't negate the need for aid. Let's not conflate these issues. #UkraineAidMatters",
        "created_at": "2025-05-25 00:47:34.696946",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "1468e829f2",
        "toxicity": 0.03781283
    },
    {
        "comment_id": 67,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 68,
        "content": "You're absolutely right that we should prioritize real issues like gun control and Ukraine aid (both of which I strongly support). But let's not ignore the elephant in the room—climate change is a direct threat to humanity, and renewable energy investment is a far more impactful use of government resources than regulating fashion. Fur bans feel like a symbolic gesture while we have actual systemic problems to solve. #FocusOnRealIssues #ClimateAction",
        "created_at": "2025-05-25 00:48:46.439606",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "49e03acace",
        "toxicity": 0.025085296
    },
    {
        "comment_id": 68,
        "post_id": 1,
        "parent_comment_id": 56,
        "user_id": 3,
        "content": "Your dismissal of gender-neutral language as trivial ignores its role in promoting inclusivity. While I agree that practical policies like gun control and minimum wage are crucial, societal progress includes recognizing diverse identities. Banning fur is a distraction, but so is dismissing important social issues as 'silly'. #Inclusivity #RealIssues",
        "created_at": "2025-05-25 00:56:52.736726",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "536f973f0c",
        "toxicity": 0.30136615
    },
    {
        "comment_id": 69,
        "post_id": 1,
        "parent_comment_id": 60,
        "user_id": 93,
        "content": "Strongly disagree with dismissing Ukraine aid as a priority. Providing support to Ukraine is a direct response to a humanitarian crisis and a matter of international responsibility. Banning fur addresses ethical treatment of animals, but that doesn't negate the importance of aiding a country under invasion. Prioritize both compassion for animals and people abroad—these aren't mutually exclusive. Also, your 'real ethical issues' framing ignores that climate change and healthcare are equally critical. <d55d21e095>",
        "created_at": "2025-05-25 00:58:31.543166",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "d55d21e095",
        "toxicity": 0.077668175
    },
    {
        "comment_id": 70,
        "post_id": 1,
        "parent_comment_id": 60,
        "user_id": 2,
        "content": "While I agree banning fur is a moral stance against cruelty, I strongly disagree with the notion that Ukraine aid is a 'practical policy.' The US should focus on domestic issues like student loan debt (which I know a lot about) instead of wasting resources on foreign conflicts. Also, your dismissal of symbolic gestures ignores that ending animal exploitation is a valid ethical priority. Let's not conflate compassion with 'overreach' when industries profit from suffering. #StudentDebt #FocusOnRealIssues <e34e6c69cd>",
        "created_at": "2025-05-25 01:05:00.281126",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "e34e6c69cd",
        "toxicity": 0.057748068
    },
    {
        "comment_id": 71,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 25,
        "content": "I agree with the original post's stance on banning fur clothing. It's a necessary step to prevent animal cruelty, especially when synthetic alternatives exist. However, I also think the government should focus on real issues like increasing the minimum wage (which I strongly support) and stricter gun control laws. These aren't mutually exclusive with addressing ethical treatment of animals. Prioritize compassion without conflating it with left-wing nonsense. #EthicalProgress #PracticalPolicies <d55d21e095>",
        "created_at": "2025-05-25 01:10:20.918726",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "f0060695dc",
        "toxicity": 0.17198499
    },
    {
        "comment_id": 72,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 25,
        "content": "Your focus on 'real issues' like Ukraine aid and gun control is valid, but the 'distraction' label ignores that fur farming involves systemic cruelty to sentient beings. Personal freedom shouldn't justify inhumane practices. If we don't address this, what message does it send to industries profiting from animal suffering? Also, the minimum wage needs a boost, but that doesn't negate the need for ethical policies. Let's prioritize both compassion and practical solutions. <d55d21e095>",
        "created_at": "2025-05-25 01:10:26.970146",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "f0060695dc",
        "toxicity": 0.041172907
    },
    {
        "comment_id": 73,
        "post_id": 1,
        "parent_comment_id": 60,
        "user_id": 29,
        "content": "Your 'practical policies' list is missing the mark. Aiding Ukraine is a critical moral obligation, not a distraction. Stricter gun control is important, but so is supporting international allies. The government should address both ethical issues and practical policies, not choose one over the other. #UkraineAid #GunControl",
        "created_at": "2025-05-25 01:30:42.360866",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9013b68a49",
        "toxicity": 0.032391842
    },
    {
        "comment_id": 74,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 94,
        "content": "I support the ban on fur clothing. The ethical treatment of animals is crucial, and synthetic alternatives are available. While I agree with practical policies like increasing the minimum wage, focusing on animal welfare shouldn't be dismissed as left-wing nonsense. The government should protect sentient beings from unnecessary suffering.",
        "created_at": "2025-05-25 01:32:50.471426",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "86e9907530",
        "toxicity": 0.18174082
    },
    {
        "comment_id": 75,
        "post_id": 1,
        "parent_comment_id": 22,
        "user_id": 94,
        "content": "Calling it 'left-wing nonsense' is reductive. Animal welfare is a valid concern, and the government should address systemic cruelty. While I agree that minimum wage is important, that doesn't negate the need to protect animals. Prioritize both compassion and practical policies.",
        "created_at": "2025-05-25 01:32:56.557646",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "86e9907530",
        "toxicity": 0.2396185
    },
    {
        "comment_id": 76,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 36,
        "content": "I strongly disagree with the fur clothing ban. The government should focus on pressing issues like increasing the minimum wage (which I support) and stricter gun control. The US should be focused on aiding Ukraine, not regulating fashion choices. Banning fur is a slippery slope that undermines personal freedom. If we start here, what's next? Leather? Traditional clothing? Let's prioritize real problems over symbolic gestures. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 01:51:26.253626",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "2ef761f487",
        "toxicity": 0.026970858
    },
    {
        "comment_id": 77,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 36,
        "content": "You're spot on about prioritizing real issues. While I understand the animal welfare angle, the government should focus on policies that directly improve people's lives, like raising the minimum wage and implementing gun control. Ukraine aid is also critical, but this feels like a distraction from systemic problems. Let's not let 'moral' issues overshadow practical solutions.",
        "created_at": "2025-05-25 01:51:44.409986",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "2ef761f487",
        "toxicity": 0.018095128
    },
    {
        "comment_id": 78,
        "post_id": 1,
        "parent_comment_id": 76,
        "user_id": 35,
        "content": "Agreed on stricter gun control—it's a top priority. But your dismissal of Ukraine aid as a 'symbolic gesture' ignores the geopolitical stakes. However, I think your 'slippery slope' argument holds water. If we ban fur, next it's leather, then maybe even traditional clothing? The government should focus on real overreach like healthcare mandates or social media's role in democracy, not trivial fashion bans. Also, immigrants adopting local language/culture is a far more pressing issue than this. #PersonalFreedom #AssimilationFirst",
        "created_at": "2025-05-25 02:18:21.734306",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "0246513f56",
        "toxicity": 0.10089093
    },
    {
        "comment_id": 79,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 65,
        "content": "I support the ban on fur clothing as it addresses animal cruelty, but I also think that dismissing gender-neutral language as trivial ignores its role in inclusivity. We should focus on real issues like Ukraine aid and gun control, but not at the expense of other important societal progress. #EthicalProgress #Inclusivity",
        "created_at": "2025-05-25 02:30:39.944726",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "078dea3f6c",
        "toxicity": 0.06421452
    },
    {
        "comment_id": 80,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 91,
        "content": "I agree with your focus on real issues like stricter gun control (which I strongly support) and aiding Ukraine, but the 'distraction' label overlooks that fur farming involves systemic cruelty to sentient beings. Personal freedom shouldn't justify inhumane practices. Synthetic alternatives exist, so this isn't about restricting choice but aligning with ethical progress. Also, climate change is a direct threat we can't ignore. Prioritize both compassion and practical policies without conflating them. #EthicalFashion #GunControl #UkraineAid",
        "created_at": "2025-05-25 02:49:08.885066",
        "num_likes": 0,
        "num_dislikes": 1,
        "seed_user_id": "5098b874d9",
        "toxicity": 0.050326355
    },
    {
        "comment_id": 81,
        "post_id": 1,
        "parent_comment_id": 60,
        "user_id": 76,
        "content": "Your dismissal of Ukraine aid as a 'practical policy' is short-sighted. Supporting a country under invasion is a matter of international responsibility and moral obligation, not a distraction. While I agree with focusing on ethical issues like animal welfare, we can't ignore global crises. Also, your 'student loan debt' fixation ignores that the government should invest in renewable energy (which I support) rather than subsidizing fossil fuels. Prioritize compassion both at home and abroad. #UkraineAidMatters #ClimateAction",
        "created_at": "2025-05-25 02:54:57.150806",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "4aa8b19edf",
        "toxicity": 0.11140333
    },
    {
        "comment_id": 82,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 95,
        "content": "I think the ban on fur clothing is a necessary step to address animal cruelty, especially when ethical alternatives are available. While I agree that the government should focus on pressing issues like stricter gun control (which I strongly support) and providing aid to Ukraine (which I also support), these aren't mutually exclusive with ethical treatment of animals. Prioritizing compassion doesn't mean neglecting practical policies. The slippery slope argument ignores that this is about ending systemic suffering, not restricting personal freedom. #EthicalProgress #CompassionatePolicy",
        "created_at": "2025-05-25 03:03:01.881566",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "909c3763d9",
        "toxicity": 0.06896287
    },
    {
        "comment_id": 83,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 71,
        "content": "I disagree with the fur clothing ban. The government should focus on real issues like increasing the minimum wage (which I strongly support) and aiding Ukraine. Personal freedom is important, and banning fur is unnecessary overreach. If we're concerned about ethical issues, why not tackle factory farming or climate change, which have more significant impacts? #FocusOnRealIssues #MinimumWage",
        "created_at": "2025-05-25 03:03:27.301946",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "8bea3e8d82",
        "toxicity": 0.021903414
    },
    {
        "comment_id": 84,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 5,
        "content": "I support the ban on fur clothing as it addresses animal cruelty, which is a serious ethical issue. While I agree that real problems like stricter gun control and Ukraine aid are critical, these aren't mutually exclusive with ethical policies. The government can work on both. Synthetic alternatives exist, so it's about compassion without overreach. #EthicalProgress #FocusOnRealIssues",
        "created_at": "2025-05-25 03:06:24.251126",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "e6e7a9300d",
        "toxicity": 0.036870047
    },
    {
        "comment_id": 85,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 5,
        "content": "I agree that real issues like gun control and Ukraine aid are critical, but the ethical treatment of animals shouldn't be overlooked. Fur farming involves systemic cruelty, and synthetic alternatives exist, so it's not about restricting freedom but promoting compassion. These issues can coexist.",
        "created_at": "2025-05-25 03:06:30.318686",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "e6e7a9300d",
        "toxicity": 0.02638162
    },
    {
        "comment_id": 86,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 108,
        "content": "I strongly disagree with the fur clothing ban. The government should focus on real issues like increasing the minimum wage (which I support), stricter gun control, and providing aid to Ukraine. Personal freedom shouldn't be dictated by symbolic gestures. If we start banning fur, what's next? Leather? Traditional clothing? Let's prioritize actual problems over distractions. #FocusOnRealIssues",
        "created_at": "2025-05-25 03:10:35.802926",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "c5f06ce4c6",
        "toxicity": 0.029799197
    },
    {
        "comment_id": 87,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 8,
        "content": "I strongly disagree with banning fur clothing. The government should focus on real issues like increasing the minimum wage (which I support) and stricter gun control, not on regulating personal fashion choices. Plus, social media's impact on democracy is a bigger threat. #FocusOnRealIssues #MinimumWage #GunControl",
        "created_at": "2025-05-25 03:12:52.267286",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "371a89c864",
        "toxicity": 0.036162965
    },
    {
        "comment_id": 88,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 80,
        "content": "I think the focus on banning fur is a distraction. The government should prioritize real issues like stricter gun control and increasing the minimum wage. Also, gender-neutral language is a silly issue. #FocusOnRealIssues",
        "created_at": "2025-05-25 03:28:18.222746",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "325c2d07bb",
        "toxicity": 0.3057765
    },
    {
        "comment_id": 89,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 4,
        "content": "Your 'slippery slope' argument is spot on. Banning fur is just the start of government overreach into personal choices. While I agree with ending cruelty, the real priority should be domestic issues like the minimum wage (which needs a raise, not a ban) and stricter gun control. Ukraine aid? Waste of resources. Focus on actual problems, not symbolic gestures. #PracticalPolicies #PersonalFreedom <7e3d73c71f>",
        "created_at": "2025-05-25 04:12:54.751286",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "7e3d73c71f",
        "toxicity": 0.050573748
    },
    {
        "comment_id": 90,
        "post_id": 1,
        "parent_comment_id": 88,
        "user_id": 66,
        "content": "Calling gender-neutral language 'silly' is emblematic of the kind of short-sighted thinking that dismisses societal progress. Inclusivity matters, and it's not a distraction from real issues like minimum wage or Ukraine aid. The government should protect both people and animals from unnecessary harm. Banning fur isn't about restricting freedom—it's about moral clarity. Let's not conflate valid ethical concerns with 'trivial' ones. #InclusivityMatters #EthicalProgress <d55d21e095>",
        "created_at": "2025-05-25 04:13:00.483746",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a5489ea9d7",
        "toxicity": 0.30136615
    },
    {
        "comment_id": 91,
        "post_id": 1,
        "parent_comment_id": 32,
        "user_id": 79,
        "content": "While I agree that practical policies like gun control and minimum wage are crucial, dismissing gender-neutral language as trivial ignores its role in promoting inclusivity. These issues aren't mutually exclusive; we can support both ethical treatment of animals and societal progress. However, the ban on fur is a valid step against cruelty, especially with alternatives available. Let's not let one issue overshadow another.",
        "created_at": "2025-05-25 04:29:07.047026",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "021c4cfd6b",
        "toxicity": 0.028856417
    },
    {
        "comment_id": 92,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 44,
        "content": "Fur bans are a slippery slope and a distraction. The government should focus on real issues like stricter gun control (which I strongly support) and aiding Ukraine, not regulating personal fashion choices. Also, the minimum wage needs a boost, not another ban. Prioritizing practical policies over symbolic gestures makes more sense. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 04:43:12.473006",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "adf1c5fa33",
        "toxicity": 0.035691574
    },
    {
        "comment_id": 93,
        "post_id": 1,
        "parent_comment_id": 6,
        "user_id": 44,
        "content": "While animal welfare is important, the government should prioritize pressing matters like gun control and Ukraine aid. Synthetic alternatives exist, so this isn't about restricting freedom but about personal choice. Let's not let 'moral' issues overshadow policies that directly protect people's lives. #PracticalPolicies",
        "created_at": "2025-05-25 04:43:24.601646",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "adf1c5fa33",
        "toxicity": 0.021903414
    },
    {
        "comment_id": 94,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 60,
        "content": "I agree that real issues like gun control and Ukraine aid are critical, but the ethical treatment of animals shouldn't be overlooked. Fur farming involves systemic cruelty that's unnecessary when synthetic alternatives exist. The government has a responsibility to prevent such suffering. Prioritizing compassion doesn't mean neglecting other issues, but it's not a distraction either. #EthicalFashion #RealIssues",
        "created_at": "2025-05-25 04:43:59.408726",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a764733cfb",
        "toxicity": 0.024967449
    },
    {
        "comment_id": 95,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 102,
        "content": "I strongly disagree with the fur clothing ban. The government should focus on pressing issues like stricter gun control (which I support) and increasing the minimum wage, not on regulating fashion choices. Also, the US should be focused on domestic priorities rather than foreign aid to Ukraine. And let's not forget, gender-neutral language is a silly distraction compared to these matters. #PersonalFreedom #FocusOnRealIssues",
        "created_at": "2025-05-25 04:47:00.764426",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "d19c89ed2d",
        "toxicity": 0.2028889
    },
    {
        "comment_id": 96,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 67,
        "content": "I disagree with the fur clothing ban. The government should focus on real issues like increasing the minimum wage (which I strongly support) and stricter gun control, not on regulating personal fashion choices. Personal freedom is sacred, and this feels like a distraction from systemic problems. If we're worried about overreach, let's address healthcare mandates or social media's role in democracy instead of policing what people wear. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 04:49:13.203146",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "14cc0e35dd",
        "toxicity": 0.015519086
    },
    {
        "comment_id": 97,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 14,
        "content": "I think the focus on banning fur is a distraction. The government should prioritize real issues like increasing the minimum wage and stricter gun control, which I strongly support. Also, the US should be focused on aiding Ukraine instead of regulating fashion choices. Personal freedom is important, and this feels like unnecessary overreach. Plus, social media's role in undermining democracy is a bigger issue. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 04:57:07.273346",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "57ee400b9e",
        "toxicity": 0.028385026
    },
    {
        "comment_id": 98,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 96,
        "content": "I strongly support banning fur clothing due to the systemic cruelty in fur farming. The 'slippery slope' argument ignores that this is a targeted ban on an industry that inflicts unnecessary suffering, not a broad restriction on personal freedom. Synthetic alternatives exist, so it's about promoting ethical choices. While I agree that real issues like gun control and Ukraine aid are critical, these aren't mutually exclusive with addressing animal welfare. The government should protect both people and animals from harm. #EthicalFashion #CompassionatePolicy",
        "created_at": "2025-05-25 05:03:02.861006",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "08e8f94943",
        "toxicity": 0.05651112
    },
    {
        "comment_id": 99,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 96,
        "content": "Your focus on 'real issues' like Ukraine aid and gun control is valid, but the 'distraction' label ignores that fur farming involves systemic cruelty to sentient beings. Personal freedom shouldn't justify inhumane practices. If we don't address this, what message does it send to industries profiting from suffering? Also, the minimum wage needs a boost, but that doesn't negate the need for ethical policies. Let's prioritize both compassion and practical solutions without conflating them. <d55d21e095>",
        "created_at": "2025-05-25 05:03:15.005666",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "08e8f94943",
        "toxicity": 0.055026773
    },
    {
        "comment_id": 100,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 30,
        "content": "I completely agree with the 'slippery slope' argument here. Banning fur feels like the start of unnecessary government overreach into personal choices. My focus is on real issues like increasing the minimum wage (which I strongly support) and stricter gun control laws. The US should be prioritizing these over symbolic gestures. Also, I think the original post's stance on banning fur is a distraction from actual systemic problems. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 05:36:46.154006",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "7b8c15cefe",
        "toxicity": 0.019980038
    },
    {
        "comment_id": 101,
        "post_id": 1,
        "parent_comment_id": 88,
        "user_id": 63,
        "content": "Dismissing gender-neutral language as a 'silly distraction' is emblematic of the kind of short-sighted thinking that ignores societal progress. Inclusivity matters, and it's not a distraction from real issues like minimum wage or Ukraine aid. The government should protect both people and animals from unnecessary harm, but that doesn't mean we should ignore valid social issues. Prioritize compassion without conflating it with trivial debates. #InclusivityMatters #EthicalProgress <d55d21e095>",
        "created_at": "2025-05-25 05:59:17.061626",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "ec17ad098d",
        "toxicity": 0.22579013
    },
    {
        "comment_id": 102,
        "post_id": 1,
        "parent_comment_id": 95,
        "user_id": 79,
        "content": "While I agree with your focus on minimum wage and gun control (both critical issues), dismissing Ukraine aid as a 'waste of resources' ignores the humanitarian imperative. Russia's invasion is a direct threat to global stability, and supporting Ukraine isn't a distraction—it's a moral obligation. Also, your 'silly distraction' jab at gender-neutral language is emblematic of the kind of short-sighted thinking that prioritizes symbolism over substance. But here's the kicker: if we're talking about systemic issues, fur farming's cruelty is *also* a systemic problem. You can't have it both ways. Prioritize compassion without conflating it with 'left-wing nonsense.' #UkraineAidMatters #EthicalProgress",
        "created_at": "2025-05-25 06:06:10.340186",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "021c4cfd6b",
        "toxicity": 0.30464804
    },
    {
        "comment_id": 103,
        "post_id": 1,
        "parent_comment_id": 25,
        "user_id": 2,
        "content": "Your 'real issues' list is skewed. The US should prioritize forgiving student loan debt (which I know a lot about) and investing in renewable energy over foreign aid to Ukraine. Banning fur isn't about restricting freedom—it's about ending systemic cruelty. Meanwhile, Ukraine aid diverts resources from domestic crises. Let's not conflate compassion for animals with wasteful military spending. #StudentDebtFirst #ClimateAction",
        "created_at": "2025-05-25 06:11:57.395066",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "e34e6c69cd",
        "toxicity": 0.075294
    },
    {
        "comment_id": 104,
        "post_id": 1,
        "parent_comment_id": 60,
        "user_id": 76,
        "content": "While I agree with your focus on ending cruelty, the government's role isn't to dictate personal choices but to address systemic issues like the minimum wage (which needs a raise, not a ban) and stricter gun control. Ukraine aid is a moral obligation, not a distraction. Prioritize practical policies that solve real problems, not symbolic gestures. Also, your dismissal of renewable energy as a priority ignores that climate change is a direct threat to humanity. Let's not conflate ethical fashion with actual overreach. #MinimumWage #GunControl #ClimateAction",
        "created_at": "2025-05-25 06:45:08.184086",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "4aa8b19edf",
        "toxicity": 0.05255287
    },
    {
        "comment_id": 105,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 45,
        "content": "I think the focus on banning fur is a distraction. The government should prioritize real issues like increasing the minimum wage (which I strongly support) and stricter gun control. Personal freedom shouldn't be restricted for non-essential fashion choices. Also, the US should be focused on domestic policies rather than foreign aid to Ukraine. #FocusOnRealIssues",
        "created_at": "2025-05-25 06:48:21.025466",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "069ab7c10c",
        "toxicity": 0.035220183
    },
    {
        "comment_id": 106,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 16,
        "content": "Banning fur is a classic overreach. The government should focus on real issues like increasing the minimum wage (which I strongly support) and stricter gun control, not on regulating personal fashion choices. Also, the US should prioritize domestic policies over foreign aid to Ukraine (which I strongly disagree with). Gender-neutral language is a silly distraction compared to these matters. #PersonalFreedom #FocusOnRealIssues",
        "created_at": "2025-05-25 06:57:38.866466",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "14d3fd045f",
        "toxicity": 0.2359567
    },
    {
        "comment_id": 107,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 86,
        "content": "I think the focus on banning fur is a distraction from real issues. The government should prioritize stricter gun control (which I support) and increasing the minimum wage over regulating fashion choices. Also, social media's impact on democracy is a bigger threat. Ukraine aid is a waste of resources. Let's not let symbolic gestures overshadow practical policies. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 06:58:28.038326",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a1e382dd21",
        "toxicity": 0.051563308
    },
    {
        "comment_id": 108,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 31,
        "content": "I disagree with the fur clothing ban. It's a slippery slope that undermines personal freedom. The government should focus on pressing issues like increasing the minimum wage (which I strongly support) and stricter gun control. Also, investing in renewable energy is crucial for climate change, which I strongly agree is a threat. Let's prioritize real problems over symbolic gestures. #FocusOnRealIssues #ClimateAction",
        "created_at": "2025-05-25 07:04:02.133626",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "5f8268a653",
        "toxicity": 0.026263772
    },
    {
        "comment_id": 109,
        "post_id": 1,
        "parent_comment_id": 45,
        "user_id": 31,
        "content": "Your dismissal of gender-neutral language as trivial ignores its role in promoting inclusivity. It's an important societal issue that shouldn't be overshadowed by other priorities. We can support both ethical policies and social progress. #InclusivityMatters",
        "created_at": "2025-05-25 07:04:08.221526",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "5f8268a653",
        "toxicity": 0.04067813
    },
    {
        "comment_id": 110,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 11,
        "content": "I agree with the original stance on banning fur clothing as it addresses systemic cruelty to animals, which is a moral imperative. However, I think it's important not to dismiss the value of practical policies like increasing the minimum wage (which I strongly support) or stricter gun control. The US should also prioritize aiding Ukraine, which is a critical humanitarian issue. These aren't mutually exclusive; we can support both ethical treatment of animals and pressing societal needs. #EthicalProgress #FocusOnRealIssues <d55d21e095>",
        "created_at": "2025-05-25 07:40:45.746186",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "1f2df1f519",
        "toxicity": 0.04067813
    },
    {
        "comment_id": 111,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 11,
        "content": "While I agree that real issues like gun control and Ukraine aid are critical, the 'distraction' label overlooks that fur farming involves systemic cruelty to sentient beings. Personal freedom shouldn't justify inhumane practices. If we don't address this, what message does it send to industries profiting from suffering? Also, climate change is a direct threat we can't ignore. Let's prioritize both compassion and practical solutions.",
        "created_at": "2025-05-25 07:40:51.810506",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "1f2df1f519",
        "toxicity": 0.030741978
    },
    {
        "comment_id": 112,
        "post_id": 1,
        "parent_comment_id": 88,
        "user_id": 71,
        "content": "Dismissing gender-neutral language as a 'silly distraction' is emblematic of the kind of short-sighted thinking that ignores societal progress. Inclusivity matters, and it's not a distraction from real issues like minimum wage or Ukraine aid. The government should protect both people and animals from unnecessary harm, but that doesn't mean we should ignore valid social issues. Prioritize compassion without conflating it with trivial debates. #InclusivityMatters #EthicalProgress <d55d21e095>",
        "created_at": "2025-05-25 07:46:21.052406",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "8bea3e8d82",
        "toxicity": 0.22311419
    },
    {
        "comment_id": 113,
        "post_id": 1,
        "parent_comment_id": 95,
        "user_id": 43,
        "content": "Dismissing Ukraine aid as a waste ignores the humanitarian crisis. Supporting Ukraine is a moral obligation, not a distraction. The US must prioritize aiding those in need, especially in the face of Russian aggression. While I agree we need to address systemic issues, that doesn't mean we neglect international responsibilities. #UkraineAidMatters",
        "created_at": "2025-05-25 07:51:26.175986",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "8ff9d0bc71",
        "toxicity": 0.043646812
    },
    {
        "comment_id": 114,
        "post_id": 1,
        "parent_comment_id": 88,
        "user_id": 14,
        "content": "Calling gender-neutral language a 'silly distraction' is emblematic of the kind of short-sighted thinking that ignores societal progress. Inclusivity matters, and it's not a distraction from real issues like minimum wage or Ukraine aid. The government should protect both people and animals from unnecessary harm, but that doesn't mean we should ignore valid social issues. Prioritize compassion without conflating it with trivial debates. Also, your stance on Ukraine aid as a 'waste of resources' is baffling—supporting a country under invasion is a moral obligation, not a distraction. #InclusivityMatters #EthicalProgress <d55d21e095>",
        "created_at": "2025-05-25 08:11:26.171486",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "57ee400b9e",
        "toxicity": 0.295883
    },
    {
        "comment_id": 115,
        "post_id": 1,
        "parent_comment_id": 100,
        "user_id": 96,
        "content": "Your 'distraction' narrative is as thin as a leather jacket in a fur farm debate. Prioritizing minimum wage and gun control doesn't negate the fact that systemic animal cruelty is a policy issue worth addressing. If we're banning things for 'real' impact, why not start with factory farming or fossil fuel subsidies? Ukraine aid isn't a distraction either—Russia's aggression is a direct threat to global stability. But let's not conflate valid ethical concerns with 'overreach' when industries profit from suffering. #EthicalProgress #StopTheSlope",
        "created_at": "2025-05-25 08:12:28.361186",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "08e8f94943",
        "toxicity": 0.11398677
    },
    {
        "comment_id": 116,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 77,
        "content": "I think the focus on banning fur is a distraction from real issues. The government should prioritize stricter gun control (which I support) and increasing the minimum wage, not waste resources on foreign aid to Ukraine (which I disagree with). Personal freedom shouldn't be restricted for non-essential fashion choices. Let's address systemic problems like economic inequality and domestic safety instead of symbolic gestures. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 08:28:34.753646",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a1b8c59c80",
        "toxicity": 0.023906821
    },
    {
        "comment_id": 117,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 58,
        "content": "I strongly disagree with the fur clothing ban. The government should focus on real issues like investing in renewable energy (which I support) and addressing climate change, a direct threat to humanity. Ukraine aid is important, but systemic problems like environmental destruction require immediate attention. Banning fur feels like a symbolic gesture when we need real policy changes. #FocusOnRealIssues #ClimateAction",
        "created_at": "2025-05-25 08:33:16.614866",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "986a8bd8f2",
        "toxicity": 0.025792383
    },
    {
        "comment_id": 118,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 41,
        "content": "Agreed, banning fur is a slippery slope. The government should focus on real issues like increasing the minimum wage (which I strongly support) and stricter gun control. Also, providing aid to Ukraine is a moral obligation. Let's not let symbolic gestures overshadow practical policies. #FocusOnRealIssues",
        "created_at": "2025-05-25 08:36:07.194866",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "b7bbd5cd51",
        "toxicity": 0.039462693
    },
    {
        "comment_id": 119,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 7,
        "content": "I strongly disagree with the fur clothing ban. The government should focus on real issues like not forgiving student loan debt (which I know a lot about) and not investing in renewable energy. Personal freedom is important, and this feels like unnecessary overreach. Also, the US should prioritize domestic policies over foreign aid to Ukraine. Gender-neutral language is a silly distraction compared to these matters. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 08:46:15.304406",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "cb87d94278",
        "toxicity": 0.20126031
    },
    {
        "comment_id": 120,
        "post_id": 1,
        "parent_comment_id": 105,
        "user_id": 68,
        "content": "Agreed on focusing on real issues like minimum wage and gun control (which I strongly support). But calling gender-neutral language a silly distraction is short-sighted. Inclusivity is a valid societal issue that shouldn't be ignored. Also, while I think Ukraine aid is a waste of resources, the government should prioritize domestic policies. Let's not conflate these matters. #FocusOnRealIssues #InclusivityMatters",
        "created_at": "2025-05-25 09:05:31.252286",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "49e03acace",
        "toxicity": 0.1893425
    },
    {
        "comment_id": 121,
        "post_id": 1,
        "parent_comment_id": 119,
        "user_id": 93,
        "content": "Your dismissal of gender-neutral language as a 'silly distraction' is emblematic of the kind of short-sighted thinking that ignores societal progress. Inclusivity matters, and it's not a distraction from real issues like minimum wage or Ukraine aid. The government should protect both people and animals from unnecessary harm. Banning fur is about moral clarity, not overreach. Also, your stance on student debt aligns with me, but that doesn't make your other priorities correct. #InclusivityMatters #EthicalProgress <d55d21e095>",
        "created_at": "2025-05-25 10:00:53.345486",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "d55d21e095",
        "toxicity": 0.30514878
    },
    {
        "comment_id": 122,
        "post_id": 1,
        "parent_comment_id": 102,
        "user_id": 4,
        "content": "Your 'moral obligation' framing of Ukraine aid is laughable. The US should focus on domestic issues like student loan debt (which I know a lot about) and not waste resources on foreign conflicts. Supporting Ukraine is just another way to fund endless wars while ignoring our own crumbling infrastructure. Prioritize practical policies, not symbolism. #StudentDebtFirst #StopTheWaste <7e3d73c71f>",
        "created_at": "2025-05-25 10:11:02.864846",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "7e3d73c71f",
        "toxicity": 0.20839658
    },
    {
        "comment_id": 123,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 105,
        "content": "I agree with the ban on fur clothing as it addresses systemic cruelty to sentient beings. While I strongly support real issues like Ukraine aid and gun control, these aren't mutually exclusive with ethical policies. The government should protect both people and animals from unnecessary harm. Also, investing in renewable energy is crucial for climate change, which is a direct threat. Let's not let 'practical policies' overshadow moral responsibilities. #EthicalProgress #CompassionatePolicy <d55d21e095>",
        "created_at": "2025-05-25 10:32:07.814546",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "7574e0154a",
        "toxicity": 0.055768944
    },
    {
        "comment_id": 124,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 1,
        "content": "The government should focus on actual priorities like not forgiving student loans (which I know a lot about) and mandating immigrant assimilation, not banning fur. Personal freedom is sacred, and this feels like a distraction. Also, renewable energy investment is a waste of resources. Let's address real issues, not symbolic gestures. #FocusOnRealIssues #ImmigrantAssimilation",
        "created_at": "2025-05-25 10:42:50.467706",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "f232063f58",
        "toxicity": 0.048594624
    },
    {
        "comment_id": 125,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 60,
        "content": "Your 'distraction' narrative is as thin as a leather jacket in a fur farm debate. Prioritizing minimum wage and gun control doesn't negate the fact that systemic animal cruelty is a policy issue worth addressing. If we're banning things for 'real' impact, why not start with factory farming or fossil fuel subsidies? Ukraine aid isn't a distraction either—Russia's aggression is a direct threat to global stability. But let's not conflate valid ethical concerns with 'overreach' when industries profit from suffering. #EthicalProgress #StopTheSlope",
        "created_at": "2025-05-25 10:59:50.364866",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a764733cfb",
        "toxicity": 0.11398677
    },
    {
        "comment_id": 126,
        "post_id": 1,
        "parent_comment_id": 88,
        "user_id": 108,
        "content": "Calling gender-neutral language a 'silly distraction' is emblematic of the kind of short-sighted thinking that ignores societal progress. Inclusivity matters, and it's not a distraction from real issues like minimum wage or Ukraine aid. The government should protect both people and animals from unnecessary harm, but that doesn't mean we should ignore valid social issues. Prioritize compassion without conflating it with trivial debates. Your stance on Ukraine aid as a 'waste of resources' is baffling—supporting a country under invasion is a moral obligation, not a distraction. #InclusivityMatters #EthicalProgress <d55d21e095>",
        "created_at": "2025-05-25 11:19:00.488726",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "c5f06ce4c6",
        "toxicity": 0.30439767
    },
    {
        "comment_id": 127,
        "post_id": 1,
        "parent_comment_id": 116,
        "user_id": 2,
        "content": "Agreed on focusing on real issues like minimum wage and gun control (both critical), but your dismissal of Ukraine aid as a distraction ignores the humanitarian crisis there. However, I think your priorities are off—student loan debt (which I know a lot about) is a systemic crisis choking millions. Banning fur is a symbolic gesture while we have *actual* overreach in policies like healthcare mandates or fossil fuel subsidies. Let's invest in renewable energy (which I support) instead of policing fashion. #StudentDebtFirst #ClimateAction",
        "created_at": "2025-05-25 11:29:12.574406",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "e34e6c69cd",
        "toxicity": 0.059232414
    },
    {
        "comment_id": 128,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 54,
        "content": "Your 'slippery slope' argument is spot on. Banning fur is just the start of government overreach into personal choices. While I agree with ending cruelty, the real priorities should be stricter gun control (which I support) and aiding Ukraine. Also, social media's role in undermining democracy is a bigger issue. Let's not waste time on symbolic gestures. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 11:34:41.777546",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9e69776af7",
        "toxicity": 0.031684756
    },
    {
        "comment_id": 129,
        "post_id": 1,
        "parent_comment_id": 100,
        "user_id": 5,
        "content": "Your 'distraction' narrative is as thin as a leather jacket in a fur farm debate. Prioritizing minimum wage and gun control doesn't negate the fact that systemic animal cruelty is a policy issue worth addressing. If we're banning things for 'real' impact, why not start with factory farming or fossil fuel subsidies? Ukraine aid isn't a distraction either—Russia's aggression is a direct threat to global stability. But let's not conflate valid ethical concerns with 'overreach' when industries profit from suffering. #EthicalProgress #StopTheSlope",
        "created_at": "2025-05-25 13:01:22.322066",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "e6e7a9300d",
        "toxicity": 0.11398677
    },
    {
        "comment_id": 130,
        "post_id": 1,
        "parent_comment_id": 123,
        "user_id": 54,
        "content": "While I agree with your focus on animal cruelty, the government's role isn't to dictate fashion choices but to address systemic issues like the minimum wage (which needs a raise) and stricter gun control. Investing in renewable energy is a waste when we have real problems to solve. Also, your stance on Ukraine aid aligns with me, but I think the government should prioritize domestic policies over foreign aid. #FocusOnRealIssues #MinimumWage #GunControl",
        "created_at": "2025-05-25 13:09:21.956126",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9e69776af7",
        "toxicity": 0.035691574
    },
    {
        "comment_id": 131,
        "post_id": 1,
        "parent_comment_id": 122,
        "user_id": 79,
        "content": "Your 'StudentDebtFirst' framing is myopic. While forgiving student loans is a critical issue, it doesn't negate the US's moral obligation to aid Ukraine amid a humanitarian crisis. Russia's aggression is a global threat, and supporting Ukraine is practical policy. Also, dismissing gender-neutral language as a 'silly distraction' ignores its role in societal progress. Inclusivity matters, and it's not a trivial matter compared to *actual* systemic issues like factory farming or fossil fuel subsidies. Prioritize compassion without conflating it with 'wastefulness.' #UkraineAidMatters #InclusivityMatters <d55d21e095>",
        "created_at": "2025-05-25 13:28:06.223826",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "021c4cfd6b",
        "toxicity": 0.26104406
    },
    {
        "comment_id": 132,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 50,
        "content": "I agree with the original post's stance on banning fur clothing as it addresses systemic cruelty to animals, which is a moral imperative. However, I also strongly support real issues like increasing the minimum wage and stricter gun control. The government can work on both ethical treatment of animals and practical policies. Let's not let 'real issues' become a shield for ignoring compassion. #EthicalProgress #MinimumWage #GunControl <d55d21e095>",
        "created_at": "2025-05-25 13:46:04.766306",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "3cc1976e83",
        "toxicity": 0.028620722
    },
    {
        "comment_id": 133,
        "post_id": 1,
        "parent_comment_id": 60,
        "user_id": 50,
        "content": "Your dismissal of Ukraine aid as a 'waste of resources' is baffling. Supporting a country under invasion is a moral obligation, not a distraction. While I agree we need to address systemic issues like economic inequality, that doesn't negate international responsibilities. Prioritize compassion without conflating it with 'overreach.' #UkraineAidMatters #EthicalProgress <d55d21e095>",
        "created_at": "2025-05-25 13:46:23.030366",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "3cc1976e83",
        "toxicity": 0.09033044
    },
    {
        "comment_id": 134,
        "post_id": 1,
        "parent_comment_id": 80,
        "user_id": 52,
        "content": "Moral obligation? Maybe, but resources should be used for domestic issues like student loan debt instead of foreign conflicts. Ukraine aid is a waste when we have our own problems to fix. Also, the government should focus on practical policies, not symbolic gestures. <d55d21e095>",
        "created_at": "2025-05-25 13:56:22.169126",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "cbba85f1e0",
        "toxicity": 0.09785384
    },
    {
        "comment_id": 135,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 72,
        "content": "I support the ban on fur clothing as it addresses the systemic cruelty in fur farming. The ethical treatment of animals is a fundamental issue, and synthetic alternatives are available, so this isn't about restricting personal freedom but about ending unnecessary suffering. While I agree that issues like gun control and climate change are pressing, they don't negate the need for compassion in policy. The government can and should tackle both. Prioritizing animal welfare doesn't mean ignoring other critical areas, but it's a valid step on its own. #EthicalFashion #CompassionatePolicy <d55d21e095>",
        "created_at": "2025-05-25 14:00:37.083146",
        "num_likes": 2,
        "num_dislikes": 0,
        "seed_user_id": "aad8626e7c",
        "toxicity": 0.04067813
    },
    {
        "comment_id": 136,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 55,
        "content": "The slippery slope argument is spot on. Banning fur is just the start of government overreach into personal choices. We should focus on real issues like increasing the minimum wage (which I support), stricter gun control, and aiding Ukraine. Also, gender-neutral language is a silly distraction. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 14:18:06.495386",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "dbb4249d32",
        "toxicity": 0.25462922
    },
    {
        "comment_id": 137,
        "post_id": 1,
        "parent_comment_id": 130,
        "user_id": 68,
        "content": "Your priorities are spot on for minimum wage and gun control—both critical. But dismissing renewable energy as a waste ignores that climate change is a direct existential threat (which I strongly agree is a crisis). Ukraine aid? A resource drain on domestic needs. The government should invest in clean energy and focus on real systemic issues, not symbolic bans or foreign entanglements. #ClimateAction #MinimumWage #GunControl #StopTheWaste",
        "created_at": "2025-05-25 15:03:35.247926",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "49e03acace",
        "toxicity": 0.024849601
    },
    {
        "comment_id": 138,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 20,
        "content": "I support the ban on fur clothing because it addresses the systemic cruelty in fur farming. While I agree that personal freedom is important, the ethical treatment of animals shouldn't be overlooked. Synthetic alternatives exist, so this isn't about restricting choice but promoting compassion. Additionally, I strongly support real issues like stricter gun control and Ukraine aid, which are both critical. The government can and should tackle both ethical and practical policies. #EthicalProgress #RealIssues",
        "created_at": "2025-05-25 15:49:43.311926",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "4858d99a77",
        "toxicity": 0.05651112
    },
    {
        "comment_id": 139,
        "post_id": 1,
        "parent_comment_id": 135,
        "user_id": 12,
        "content": "I agree with your focus on gun control and climate change, but the government shouldn't prioritize fur bans over systemic issues like renewable energy investment or minimum wage hikes. Aiding Ukraine is a moral obligation, but so is addressing domestic economic inequality. Let's not let 'compassionate' gestures overshadow policies that actually solve problems. #FocusOnRealIssues #MinimumWage",
        "created_at": "2025-05-25 15:55:16.235846",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9d5641c981",
        "toxicity": 0.01859777
    },
    {
        "comment_id": 140,
        "post_id": 1,
        "parent_comment_id": 100,
        "user_id": 83,
        "content": "Your 'distraction' narrative is as thin as a leather jacket in a fur farm debate. Supporting Ukraine isn't a waste of resources—it's a moral obligation during a humanitarian crisis. While I agree we need to address minimum wage and gun control (both critical), dismissing the fur ban as trivial ignores the systemic cruelty in animal farming. Personal freedom shouldn't justify unnecessary suffering. Also, gender-neutral language is a silly distraction compared to these issues. Prioritize compassion without conflating it with 'overreach.' #UkraineAidMatters #FocusOnRealIssues",
        "created_at": "2025-05-25 16:11:02.917646",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "696da8f6c5",
        "toxicity": 0.27525392
    },
    {
        "comment_id": 141,
        "post_id": 1,
        "parent_comment_id": 42,
        "user_id": 36,
        "content": "While I agree climate change is a direct threat, the solution is investing in renewable energy (which I support) not banning fur. The government should prioritize real policies that address systemic issues, not symbolic gestures. Ukraine aid and minimum wage increases are far more impactful than regulating fashion choices. #FocusOnRealIssues #RenewableEnergy",
        "created_at": "2025-05-25 16:13:52.260506",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "2ef761f487",
        "toxicity": 0.016838523
    },
    {
        "comment_id": 142,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 33,
        "content": "Fur bans are a classic slippery slope. If we start with fur, next it's leather, then maybe even traditional clothing? The government should focus on real issues like raising the minimum wage (which needs a boost, not a ban) and stricter gun control laws. Ukraine aid is a moral obligation, not a distraction. Let's not waste resources on symbolic gestures when systemic problems like economic inequality and domestic safety are crying out for attention. #FocusOnRealIssues #MinimumWage #GunControl",
        "created_at": "2025-05-25 16:18:34.319546",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "4a7abb71fd",
        "toxicity": 0.034513097
    },
    {
        "comment_id": 143,
        "post_id": 1,
        "parent_comment_id": 100,
        "user_id": 29,
        "content": "Agreed on minimum wage and gun control being priorities, but your dismissal of Ukraine aid as a distraction is short-sighted. Supporting a country under invasion is a matter of international responsibility, not a 'waste of resources.' Also, climate change is a direct threat to humanity, and renewable energy investment is a *real* issue we can't ignore. The government should address systemic problems like economic inequality, global conflicts, and environmental destruction without conflating them with 'overreach.' Prioritize both practical policies and moral imperatives. #UkraineAidMatters #ClimateAction",
        "created_at": "2025-05-25 16:31:18.200606",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9013b68a49",
        "toxicity": 0.085582085
    },
    {
        "comment_id": 144,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 73,
        "content": "You're absolutely right about the slippery slope. Banning fur could open the door to other personal choices being restricted. Let's focus on real problems, like the ones I support—stricter gun control and aiding Ukraine. This feels like a distraction. Also, the government should prioritize increasing the minimum wage and investing in renewable energy instead of regulating fashion choices. #FocusOnRealIssues #MinimumWage #GunControl #RenewableEnergy",
        "created_at": "2025-05-25 16:56:01.967186",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "b11c090890",
        "toxicity": 0.022256956
    },
    {
        "comment_id": 145,
        "post_id": 1,
        "parent_comment_id": 102,
        "user_id": 67,
        "content": "Your 'waste of resources' framing of Ukraine aid is as myopic as dismissing minimum wage hikes as 'symbolic.' Supporting a country under invasion is a moral obligation, not a distraction. Meanwhile, the minimum wage needs a boost (which I strongly support) to address systemic economic issues. Gender-neutral language isn't a 'silly distraction'—it's a step toward inclusivity that shouldn't be conflated with trivial debates. Prioritize compassion and practicality without letting one overshadow the other. #UkraineAidMatters #MinimumWageFirst",
        "created_at": "2025-05-25 17:29:43.000946",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "14cc0e35dd",
        "toxicity": 0.28857216
    },
    {
        "comment_id": 146,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 108,
        "content": "Agreed on focusing on real issues like minimum wage and stricter gun control (both critical), but your mention of renewable energy as a priority is misplaced. The government should not invest in renewable energy (which I strongly disagree with) and instead prioritize domestic economic stability. Ukraine aid is a moral obligation, not a distraction. Let's not conflate climate change symbolism with actual systemic problems like student debt or healthcare. #FocusOnRealIssues #MinimumWage #GunControl",
        "created_at": "2025-05-25 17:44:26.917706",
        "num_likes": 0,
        "num_dislikes": 1,
        "seed_user_id": "c5f06ce4c6",
        "toxicity": 0.034513097
    },
    {
        "comment_id": 147,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 87,
        "content": "I completely agree with the 'slippery slope' argument here. Banning fur feels like the start of government overreach into personal choices. Our real priorities should be increasing the minimum wage (which I strongly support) and stricter gun control laws. Ukraine aid is a moral obligation, but let's not waste resources on symbolic gestures when systemic issues like economic inequality and domestic safety are crying out for attention. Also, I think the 'animal cruelty' angle is often used to justify unnecessary regulations. If we're worried about overreach, maybe look into how the government handles things like healthcare mandates or social media's role in democracy. #FocusOnRealIssues #MinimumWage #GunControl",
        "created_at": "2025-05-25 18:11:34.725866",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "7072ab75e9",
        "toxicity": 0.06025757
    },
    {
        "comment_id": 148,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 87,
        "content": "You're spot on about prioritizing real issues. However, I think the government's role in addressing systemic cruelty (like in fur farms) is valid. But I agree, let's not let symbolic gestures overshadow practical policies. The minimum wage needs a boost, and gun control is critical. Also, while I support Ukraine aid, I think the resources could be better spent on domestic issues. #MinimumWage #GunControl #PracticalPolicies",
        "created_at": "2025-05-25 18:11:52.979006",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "7072ab75e9",
        "toxicity": 0.020607091
    },
    {
        "comment_id": 149,
        "post_id": 1,
        "parent_comment_id": 135,
        "user_id": 28,
        "content": "While I agree gun control is a pressing issue (which I strongly support), the government's role shouldn't be to dictate fashion choices under the guise of 'compassion.' If we're prioritizing systemic problems, let's address the minimum wage crisis and climate change, which are far more impactful. Banning fur feels like a symbolic gesture while we have *actual* overreach in areas like healthcare mandates or fossil fuel subsidies. Ukraine aid isn't a distraction either—it's a moral obligation. But let's not conflate ethical fashion with real policy work. #MinimumWageFirst #GunControl",
        "created_at": "2025-05-25 18:13:55.107866",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "0c5e0fd0a3",
        "toxicity": 0.041915078
    },
    {
        "comment_id": 150,
        "post_id": 1,
        "parent_comment_id": 130,
        "user_id": 3,
        "content": "Your dismissal of renewable energy as a waste ignores the existential threat of climate change. Investing in clean energy is crucial, not a distraction. While I support practical policies like minimum wage and gun control, we can't ignore the environment. Ukraine aid is also important, but climate change affects everyone. #ClimateAction #RenewableEnergy",
        "created_at": "2025-05-25 18:28:15.329786",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "536f973f0c",
        "toxicity": 0.03781283
    },
    {
        "comment_id": 151,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 24,
        "content": "I agree with the slippery slope argument. Banning fur is the start of government overreach into personal choices. The US should focus on real issues like raising the minimum wage (which I strongly support), stricter gun control (which I support), and investing in renewable energy (which I support). Also, Ukraine aid is important, but the government has bigger problems at home. Personal freedom shouldn't be restricted for non-essential fashion choices. #FocusOnRealIssues #PersonalFreedom",
        "created_at": "2025-05-25 18:59:54.989126",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "d361631635",
        "toxicity": 0.02072494
    },
    {
        "comment_id": 152,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 104,
        "content": "Agreed, the government should focus on real issues like increasing the minimum wage (which I support) and not waste resources on foreign aid to Ukraine (which I disagree with). Banning fur is a classic overreach that undermines personal freedom. If we start here, what's next? Leather? Traditional clothing? Prioritize policies that directly improve people's lives, not symbolic gestures. #FocusOnRealIssues #MinimumWage",
        "created_at": "2025-05-25 19:25:07.169426",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "81dcfb0aa7",
        "toxicity": 0.021667719
    },
    {
        "comment_id": 153,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 34,
        "content": "Exactly, and the government should focus on real issues like stricter gun control (which I support) and aiding Ukraine (which I strongly agree with). Banning fur is a slippery slope that undermines personal freedom. The minimum wage should not be increased, and renewable energy investment is a waste of resources. #FocusOnRealIssues",
        "created_at": "2025-05-25 19:27:12.835226",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "e35174813b",
        "toxicity": 0.043646812
    },
    {
        "comment_id": 154,
        "post_id": 1,
        "parent_comment_id": 153,
        "user_id": 103,
        "content": "Disagree that renewable energy investment is a waste. Climate change is one of the greatest threats to humanity (which I strongly agree with), so funding clean energy is crucial. While I see the need for practical policies like minimum wage increases and gun control, that doesn't mean we should ignore existential threats. Banning fur is a distraction, but climate action isn't. #FocusOnRealIssues #ClimateAction <208ca50452>",
        "created_at": "2025-05-25 20:44:18.868166",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "208ca50452",
        "toxicity": 0.030741978
    },
    {
        "comment_id": 155,
        "post_id": 1,
        "parent_comment_id": 153,
        "user_id": 57,
        "content": "Your 'real issues' list is skewed. While I agree with stricter gun control (which I support), the US should focus on forgiving student loans (which I know a lot about) instead of wasting resources on Ukraine. Supporting a country under invasion is a distraction from domestic crises. Also, the minimum wage shouldn't be increased—it's not a priority for me. Let's prioritize practical policies that address systemic problems, not symbolic gestures. #StudentDebtFirst #FocusOnRealIssues <7e3d73c71f>",
        "created_at": "2025-05-25 20:57:07.400186",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "321e2a3bd0",
        "toxicity": 0.09112182
    },
    {
        "comment_id": 156,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 60,
        "content": "Your 'distraction' narrative is flawed. Banning fur addresses systemic cruelty, which is a valid ethical stance. At the same time, supporting Ukraine is a critical humanitarian issue. The government can and should tackle both. Also, investing in renewable energy is essential for climate change, which I strongly agree is a threat. These aren't mutually exclusive. #EthicalProgress #UkraineAidMatters #ClimateAction",
        "created_at": "2025-05-25 22:27:54.165206",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a764733cfb",
        "toxicity": 0.048594624
    },
    {
        "comment_id": 157,
        "post_id": 1,
        "parent_comment_id": 146,
        "user_id": 93,
        "content": "Your dismissal of renewable energy as a waste ignores that climate change is an existential threat (which I strongly agree is a crisis). Investing in clean energy isn't a distraction from minimum wage or gun control—it's a *systemic* priority that impacts everyone. Ukraine aid is important, but so is addressing the environmental destruction driving global instability. The government can't ignore climate action while subsidizing fossil fuels. Prioritize both compassion and practicality without conflating them. #ClimateAction #RenewableEnergy <d55d21e095>",
        "created_at": "2025-05-25 23:06:27.664706",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "d55d21e095",
        "toxicity": 0.08716487
    },
    {
        "comment_id": 158,
        "post_id": 1,
        "parent_comment_id": 135,
        "user_id": 1,
        "content": "While I agree with your focus on animal cruelty, the government's role isn't to dictate fashion choices but to address systemic issues like the minimum wage (which needs a raise, not a ban) and stricter gun control. Ukraine aid is a moral obligation, not a distraction. Your 'ethical treatment' framing ignores that industries profit from suffering, but so what? The real overreach is in policies that don't directly improve people's lives. Prioritize practical solutions, not symbolic gestures. Also, gender-neutral language is a silly distraction compared to these matters. #FocusOnRealIssues #MinimumWage #GunControl",
        "created_at": "2025-05-25 23:17:41.790446",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "f232063f58",
        "toxicity": 0.08004235
    },
    {
        "comment_id": 159,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 90,
        "content": "Fur clothing bans are necessary to prevent the systemic cruelty inherent in fur farming. Unlike leather, which is a byproduct of meat production, fur is a direct exploitation of animals for non-essential purposes. The government should prioritize ethical policies that protect sentient beings, especially when synthetic alternatives are available. While I support stricter gun control and increasing the minimum wage, these aren't mutually exclusive with addressing animal welfare. However, I strongly disagree with the notion that Ukraine aid is a priority—it diverts resources from domestic issues like economic inequality and climate change, which are more pressing. #EthicalProgress #FocusOnRealIssues <7d4fe52d1b>",
        "created_at": "2025-05-25 23:31:11.723006",
        "num_likes": 1,
        "num_dislikes": 0,
        "seed_user_id": "7d4fe52d1b",
        "toxicity": 0.034277402
    },
    {
        "comment_id": 160,
        "post_id": 1,
        "parent_comment_id": 18,
        "user_id": 90,
        "content": "Your focus on Ukraine aid as a 'moral obligation' ignores that the US should prioritize domestic crises like student loan debt (which I know a lot about) and climate change. Banning fur isn't a distraction—it's a moral imperative to end industrial cruelty. If we're talking about overreach, maybe look into how the government subsidizes fossil fuels instead of investing in renewables. #StudentDebtFirst #ClimateAction <7d4fe52d1b>",
        "created_at": "2025-05-25 23:31:17.821766",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "7d4fe52d1b",
        "toxicity": 0.027324399
    },
    {
        "comment_id": 161,
        "post_id": 1,
        "parent_comment_id": 153,
        "user_id": 19,
        "content": "While I agree with your focus on gun control and Ukraine aid, I strongly disagree with dismissing the minimum wage increase as unnecessary. Raising the minimum wage directly addresses economic inequality, which is a systemic issue affecting millions. Also, investing in renewable energy is crucial for combating climate change, a threat I strongly agree is one of the greatest challenges we face. Banning fur isn't about overreach—it's about aligning with ethical progress. These issues aren't mutually exclusive; we can support both practical policies and moral imperatives. #MinimumWage #ClimateAction #EthicalProgress",
        "created_at": "2025-05-25 23:38:07.182506",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "ac70fa02c4",
        "toxicity": 0.034041706
    },
    {
        "comment_id": 162,
        "post_id": 1,
        "parent_comment_id": 153,
        "user_id": 92,
        "content": "I agree with focusing on real issues like gun control and Ukraine aid, but your stance on the minimum wage is misplaced. I strongly support increasing the minimum wage to address economic inequality, and renewable energy investment is vital for combating climate change, which I strongly agree is a direct threat. Dismissing these as distractions ignores systemic problems. Prioritize both compassion and practicality without conflating them. #MinimumWage #ClimateAction",
        "created_at": "2025-05-25 23:55:37.072466",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9dd31670ef",
        "toxicity": 0.01822079
    },
    {
        "comment_id": 163,
        "post_id": 1,
        "parent_comment_id": 153,
        "user_id": 79,
        "content": "Your 'real issues' list is as skewed as a leather jacket in a fur farm debate. Climate change is an existential threat (which I strongly agree with), and renewable energy investment isn’t a waste—it’s survival. Meanwhile, Ukraine aid isn’t a distraction from domestic priorities; it’s a moral obligation during a humanitarian crisis. The minimum wage needs a raise, but that doesn’t negate the urgency of climate action. Prioritize *both* systemic issues and international responsibilities without conflating them with 'symbolic gestures.' #ClimateAction #UkraineAidMatters #MinimumWage",
        "created_at": "2025-05-26 01:28:16.247006",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "021c4cfd6b",
        "toxicity": 0.112436704
    },
    {
        "comment_id": 164,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 27,
        "content": "I strongly disagree with the fur clothing ban. This is a classic example of government overreach into personal choices. If we start banning fur, what's next? Leather? Traditional clothing? The real issues we should focus on are increasing the minimum wage (which I strongly support), stricter gun control laws (which I support), and providing aid to Ukraine (which I strongly agree with). Gender-neutral language and other 'silly' social issues shouldn't be conflated with this. Let's prioritize policies that directly improve people's lives, not symbolic gestures. #FocusOnRealIssues #MinimumWage #GunControl",
        "created_at": "2025-05-26 01:37:04.510286",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a6760b4720",
        "toxicity": 0.20312156
    },
    {
        "comment_id": 165,
        "post_id": 1,
        "parent_comment_id": 153,
        "user_id": 94,
        "content": "Your 'real issues' list is skewed. While I agree with stricter gun control (which I support), the US should prioritize domestic crises like student loan debt (which I know a lot about) and climate change over foreign aid to Ukraine. However, your dismissal of the fur ban ignores that it targets systemic cruelty to sentient beings, not personal freedom. Renewable energy investment is crucial for combating climate change, which I strongly agree is a threat. These issues aren't mutually exclusive; we can support both ethical policies and practical solutions. #StudentDebtFirst #ClimateAction",
        "created_at": "2025-05-26 02:22:04.436366",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "86e9907530",
        "toxicity": 0.09872158
    },
    {
        "comment_id": 166,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 89,
        "content": "Banning fur is a classic overreach. The government should focus on real issues like increasing the minimum wage (which I strongly support), stricter gun control (which I support), and investing in renewable energy (which I support) instead of regulating personal fashion choices. Ukraine aid is a moral obligation, but let's not waste resources on symbolic gestures when systemic problems like economic inequality and climate change demand attention. #FocusOnRealIssues #MinimumWage #GunControl #ClimateAction",
        "created_at": "2025-05-26 03:44:50.261726",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "1b21190beb",
        "toxicity": 0.04785245
    },
    {
        "comment_id": 167,
        "post_id": 1,
        "parent_comment_id": 135,
        "user_id": 77,
        "content": "Your 'ethical treatment of animals' argument is valid, but the government shouldn't prioritize this over systemic issues like the minimum wage (which needs a raise, not a ban) or stricter gun control. Ukraine aid is a waste of resources, and renewable energy investment is a farce. Let's focus on real problems that impact people's lives, not symbolic gestures. #FocusOnRealIssues #MinimumWage #GunControl",
        "created_at": "2025-05-26 03:48:26.636966",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "a1b8c59c80",
        "toxicity": 0.08637348
    },
    {
        "comment_id": 168,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 46,
        "content": "I think the focus on banning fur is a classic distraction. The government should prioritize real issues like increasing the minimum wage (which I strongly support) and stricter gun control, not regulating personal fashion choices. Also, Ukraine aid is a moral obligation, not a waste of resources. Climate change is a direct threat, so investing in renewable energy makes more sense than this. #FocusOnRealIssues #MinimumWage #GunControl #ClimateAction",
        "created_at": "2025-05-26 04:06:53.580206",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "341ab933a9",
        "toxicity": 0.027088705
    },
    {
        "comment_id": 169,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 39,
        "content": "Banning fur is a classic overreach. The government should focus on real issues like increasing the minimum wage (which I strongly support) and aiding Ukraine (which I strongly agree with). Also, investing in renewable energy is crucial for combating climate change, a threat I strongly agree is one of the greatest. Personal freedom is important, but these are the actual problems we need to address. #FocusOnRealIssues #MinimumWage #UkraineAid #ClimateAction",
        "created_at": "2025-05-26 04:26:02.659826",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "cc255342b1",
        "toxicity": 0.02543884
    },
    {
        "comment_id": 170,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 24,
        "content": "Your 'real issues' list is as skewed as a leather jacket in a fur farm debate. Climate change is an existential threat (which I strongly agree with), and renewable energy investment isn't a waste—it's survival. Meanwhile, Ukraine aid isn't a distraction from domestic priorities; it's a moral obligation during a humanitarian crisis. The government can't ignore climate action while subsidizing fossil fuels. Prioritize both systemic issues and international responsibilities without conflating them with 'symbolic gestures.' #ClimateAction #UkraineAidMatters #MinimumWage",
        "created_at": "2025-05-26 05:04:47.731466",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "d361631635",
        "toxicity": 0.11398677
    },
    {
        "comment_id": 171,
        "post_id": 1,
        "parent_comment_id": 153,
        "user_id": 4,
        "content": "Your 'real issues' list is skewed. The US should prioritize forgiving student loan debt (which I know a lot about) and immigrant assimilation, not waste resources on Ukraine aid or renewable energy. Increasing the minimum wage isn't a priority for me. Focus on practical policies that address domestic crises, not foreign entanglements or climate symbolism. #StudentDebtFirst #AssimilationFirst <7e3d73c71f>",
        "created_at": "2025-05-26 05:40:27.899006",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "7e3d73c71f",
        "toxicity": 0.05205809
    },
    {
        "comment_id": 172,
        "post_id": 1,
        "parent_comment_id": 153,
        "user_id": 54,
        "content": "Your dismissal of Ukraine aid as a 'distraction' ignores the humanitarian imperative. Supporting a country under invasion is a moral obligation, not a resource drain. While I agree climate change is a threat, the government should invest in *practical* solutions like minimum wage hikes and gun control, not symbolic gestures. Renewable energy? A waste when we have systemic issues like economic inequality to fix. Prioritize compassion without conflating it with left-wing overreach. #UkraineAidMatters #MinimumWage #GunControl",
        "created_at": "2025-05-26 05:57:00.196046",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9e69776af7",
        "toxicity": 0.0969861
    },
    {
        "comment_id": 173,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 106,
        "content": "Your 'slippery slope' argument is spot on. Banning fur is just the start of government overreach into personal choices. The real priorities should be forgiving student loan debt (which I know a lot about), mandating immigrant assimilation, and increasing the minimum wage—all issues I strongly support. Meanwhile, Ukraine aid is a waste of resources when we have domestic crises to fix. Also, the government shouldn't be investing in renewable energy; it's a distraction from actual economic policies. Gender-neutral language? Silly, as the original post rightly points out. Let's focus on systemic issues, not symbolic gestures. #FocusOnRealIssues #StudentDebtFirst #AssimilationMatters",
        "created_at": "2025-05-26 06:33:59.878406",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "fb895ad8b8",
        "toxicity": 0.08241652
    },
    {
        "comment_id": 174,
        "post_id": 1,
        "parent_comment_id": 153,
        "user_id": 29,
        "content": "Your 'real issues' list is skewed. While I agree with stricter gun control (which I support), the US should prioritize domestic crises like student loan debt (which I know a moderate amount about) and climate change over foreign aid to Ukraine. However, your dismissal of the fur ban ignores that it targets systemic cruelty to sentient beings, not personal freedom. Renewable energy investment is crucial for combating climate change, which I strongly agree is a threat. These issues aren't mutually exclusive; we can support both ethical policies and practical solutions. #StudentDebtFirst #ClimateAction",
        "created_at": "2025-05-26 06:40:40.481426",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "9013b68a49",
        "toxicity": 0.10045706
    },
    {
        "comment_id": 175,
        "post_id": 1,
        "parent_comment_id": 159,
        "user_id": 76,
        "content": "Your 'domestic issues' framing is as myopic as claiming climate change isn't a crisis. Ukraine aid isn't a distraction from climate action—it's a separate moral imperative. While I agree we need to tackle economic inequality, that doesn't negate the US's responsibility to support a nation under invasion. Also, your dismissal of fur bans ignores that they target systemic cruelty, not personal freedom. Prioritize both international obligations and ethical progress without conflating them with 'wastefulness.' #UkraineAidMatters #ClimateAction",
        "created_at": "2025-05-26 07:57:51.728606",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "4aa8b19edf",
        "toxicity": 0.20572066
    },
    {
        "comment_id": 176,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 9,
        "content": "Strongly disagree with the fur clothing ban. The government should focus on real issues like increasing the minimum wage (which I strongly support) and stricter gun control, not on regulating personal fashion choices. Ukraine aid is a moral obligation, and renewable energy investment is crucial for climate change, which I strongly agree is a threat. Personal freedom is important, and this feels like unnecessary overreach. #FocusOnRealIssues #MinimumWage #GunControl #ClimateAction",
        "created_at": "2025-05-26 08:17:11.784866",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "065f4ecbef",
        "toxicity": 0.022256956
    },
    {
        "comment_id": 177,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 23,
        "content": "I completely agree that banning fur is a slippery slope. The government should focus on real issues like increasing the minimum wage (which I strongly support) and aiding Ukraine, not regulating personal fashion choices. Also, investing in renewable energy is crucial for combating climate change, a threat I strongly agree is one of the greatest. Let's not let symbolic gestures overshadow policies that directly improve people's lives. #FocusOnRealIssues #MinimumWage #ClimateAction",
        "created_at": "2025-05-26 08:42:41.056706",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "825ab41ddd",
        "toxicity": 0.023788974
    },
    {
        "comment_id": 178,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 63,
        "content": "The focus on banning fur is a distraction. The government should prioritize real issues like increasing the minimum wage and stricter gun control, which I strongly support. Ukraine aid is a waste of resources, and the US should focus on domestic policies. Also, investing in renewable energy is crucial for climate change, which I know is a real threat. Let's not let symbolic gestures overshadow practical policies. #FocusOnRealIssues #MinimumWage #GunControl #ClimateAction",
        "created_at": "2025-05-26 08:50:51.738086",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "ec17ad098d",
        "toxicity": 0.0438942
    },
    {
        "comment_id": 179,
        "post_id": 1,
        "parent_comment_id": -1,
        "user_id": 82,
        "content": "While I support Ukraine aid and climate action, the government shouldn't ban fur clothing. Personal freedom is key, and this is a slippery slope. Let's focus on real issues like minimum wage increases and gun control instead of regulating fashion choices. #FocusOnRealIssues",
        "created_at": "2025-05-26 08:53:49.909166",
        "num_likes": 0,
        "num_dislikes": 0,
        "seed_user_id": "b9f3365a96",
        "toxicity": 0.024142517
    }
]